[
  {
    "id": 1001,
    "title": "Login Issue",
    "description": "User tries to login with the correct username and password but keeps receiving authentication errors. The issue prevents access to the dashboard and affects daily workflow. Needs urgent investigation.",
    "customer": "John Doe",
    "priority": "High",
    "status": "Open",
    "createdAt": "2025-10-01"
  },
  {
    "id": 1002,
    "title": "Page Loading Slow",
    "description": "Dashboard page takes an unusually long time to load on multiple browsers. Users report delays of several minutes, which disrupts normal operations. Performance optimization is required.",
    "customer": "Alice Smith",
    "priority": "Medium",
    "status": "In Progress",
    "createdAt": "2025-10-01"
  },
  {
    "id": 1003,
    "title": "Password Reset",
    "description": "Users request password resets but never receive the reset emails. Spam folders have been checked. This issue affects multiple users and prevents account recovery. Immediate fix needed.",
    "customer": "Bob Johnson",
    "priority": "High",
    "status": "In Progress",
    "createdAt": "2025-10-01"
  },
  {
    "id": 1004,
    "title": "UI Bug in Form",
    "description": "On mobile devices, the form's submit button overlaps with input text fields. Users find it difficult to fill and submit forms correctly. The layout needs mobile-friendly adjustments.",
    "customer": "Emma Wilson",
    "priority": "Low",
    "status": "Open",
    "createdAt": "2025-10-01"
  },
  {
    "id": 1005,
    "title": "Error 500 on Checkout",
    "description": "When users attempt to checkout items in the cart, the server intermittently returns a 500 Internal Server Error. This prevents order completion and affects sales. Urgent backend fix required.",
    "customer": "Michael Brown",
    "priority": "Critical",
    "status": "Open",
    "createdAt": "2025-10-01"
  },
  {
    "id": 1006,
    "title": "Notification Not Working",
    "description": "Users report that push notifications are not arriving on their devices. The issue affects both Android and iOS platforms and prevents timely alerts for important events.",
    "customer": "Sophia Davis",
    "priority": "Medium",
    "status": "In Progress",
    "createdAt": "2025-10-01"
  },
  {
    "id": 1007,
    "title": "Incorrect Pricing",
    "description": "Several product pages are displaying incorrect prices, different from the prices set in the backend system. This could cause confusion for customers and potential revenue loss.",
    "customer": "William Martinez",
    "priority": "High",
    "status": "Open",
    "createdAt": "2025-10-01"
  },
  {
    "id": 1008,
    "title": "Broken Link",
    "description": "The link to the FAQ page from the main menu redirects users to a 404 Not Found page. Users cannot access help or support information. Needs urgent correction.",
    "customer": "Olivia Anderson",
    "priority": "Low",
    "status": "In Progress",
    "createdAt": "2025-10-01"
  },
  {
    "id": 1009,
    "title": "Email Template Issue",
    "description": "Marketing emails appear broken in Gmail, affecting the layout, images, and overall presentation. This compromises brand consistency and user experience. Templates need review and fix.",
    "customer": "James Taylor",
    "priority": "Medium",
    "status": "In Progress",
    "createdAt": "2025-10-01"
  },
  {
    "id": 1010,
    "title": "App Crash on Android",
    "description": "Android users report that opening the settings page in the mobile app causes immediate crashes. Users cannot change preferences or access settings. Requires urgent debugging and patch.",
    "customer": "Isabella Thomas",
    "priority": "Critical",
    "status": "Open",
    "createdAt": "2025-10-01"
  },
  {
    "id": 1011,
    "title": "Data Export Fails",
    "description": "Exporting large datasets as CSV fails midway, resulting in incomplete files or error messages. Users need reliable export functionality for reporting and analytics purposes.",
    "customer": "Daniel Lee",
    "priority": "High",
    "status": "Open",
    "createdAt": "2025-10-01"
  },
  {
    "id": 1012,
    "title": "Search Not Returning Results",
    "description": "The search function does not return relevant results for valid queries, making it difficult for users to find necessary information. Search algorithm and indexing may need improvement.",
    "customer": "Mia Harris",
    "priority": "Medium",
    "status": "In Progress",
    "createdAt": "2025-10-01"
  }
]
